nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_ACCEL_EN_GPIO GPIOF               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACCEL_EN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ACCEL_EN_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_ACCEL_EN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_ACCEL_EN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

/*!
 * @brief
 * UART1 IRDA Select: Pad RX input (PTD[2] or PTI[0], as selected in Pinmux control) selected for RX input of
 * UART1 and UART1 TX signal is not used for modulation.
 */
#define MISC_CTL_UART1IRSEL_0b0 0x00u

/*! @name PORTI0 (number 91), J18[A43]/J10[12]/J11[17]/PTI0/SCI1_RXD
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTI1 (number 92), J18[A44]/J10[13]/J11[18]/PTI1/SCI1_TXD
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTE2 (number 57), X1[3]/EXTAL_8MHz_KM38
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_XTAL_8MHz_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_XTAL_8MHz_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_XTAL_8MHz_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTE3 (number 58), X1[1]/XTAL_8MHz_KM38
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL_8MHz_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL_8MHz_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_EXTAL_8MHz_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name EXTAL32K (number 26), Y1[2]/EXTAL_32K_KM38
  @{ */
/* @} */

/*! @name XTAL32K (number 25), Y1[1]/XTAL_32K_KM38
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

#define PORT_DFER_DFE_0_MASK 0x01u /*!<@brief Digital Filter Enable Mask for item 0. */

/*! @name PORTE0 (number 55), J18[A8]/J10[15]/U7[3]/S1[14]/J11[4]/U14[21]/PTE0/I2C0_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EEPROM_SDA_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_EEPROM_SDA_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_EEPROM_SDA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTD7 (number 54), J18[A7]/J10[16]/U7[5]/S1[13]/J11[3]/U14[20]/PTD7/I2C0_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EEPROM_SCL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_EEPROM_SCL_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_EEPROM_SCL_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEEPROMPins(void);

/*!
 * @brief
 * UART0 IRDA Select: UART0 selected for IRDA modulation.
 * UART0 TX modulated by XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13].
 */
#define MISC_CTL_UART0IRSEL_0b1 0x01u
/*!
 * @brief UART Modulation Type: TypeB (ANDed) Modulation selected for IRDA */
#define MISC_CTL_UARTMODTYPE_0b1 0x01u

/*! @name PORTC3 (number 22), J18[A41]/S1[15]/PTC3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_IR_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_IR_RX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_IR_RX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC2 (number 21), J18[A42]/S1[16]/PTC2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_IR_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_IR_TX_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_IR_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitINFRA_REDPins(void);

/*! @name PORTG1 (number 76), J8[1]/PTG1/AD10
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC_POT_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC_POT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_ADC_POT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPOTENTIOMETERPins(void);

/*! @name PORTF0 (number 67), J9[1]/PTF0/AD7
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC_TEMP_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC_TEMP_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_ADC_TEMP_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTEMP_SENSORPins(void);

/*! @name PORTC4 (number 23), J18[D44]/DS[1]/LCD43
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD43_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD43_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD43_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB6 (number 17), J18[D32]/DS1[2]/LCD37
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD37_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD37_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD37_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB5 (number 16), J18[D28]/DS1[3]/LCD36
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD36_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD36_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD36_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB4 (number 15), J18[D27]/DS1[4]/LCD35
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD35_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD35_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD35_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

