nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.h
/*! @name PORTB3 (number 14), J18[C80]/DS1[5]/LCD34
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD34_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD34_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD34_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB2 (number 13), J18[D80]/DS1[6]/LCD33
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD33_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD33_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD33_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB1 (number 12), J18[D79]/DS1[7]/LCD32
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD32_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD32_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD32_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB0 (number 9), J18[D78]/DS1[8]/LCD31
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD31_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD31_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD31_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA5 (number 6), J18[D64]/DS1[9]/LCD28
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD28_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD28_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD28_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA4 (number 5), J18[D63]/DS1[10]/LCD27
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD27_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD27_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD27_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA3 (number 4), J18[C64]/DS1[11]/LCD26
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD26_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD26_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD26_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA2 (number 3), J18[C63]/DS1[12]/LCD25
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD25_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD25_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD25_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA1 (number 2), J18[C62]/DS1[13]/LCD24
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD24_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD24_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD24_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA0 (number 1), J18[D54]/DS1[14]/LCD23
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD23_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD23_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD23_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTI3 (number 94), J18[D53]/DS1[15]/LCD22
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD22_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD22_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD22_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTI2 (number 93), J18[D52]/DS1[16]/LCD21
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD21_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD21_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD21_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH5 (number 88), J18[C57]/DS1[17]/LCD20
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD20_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD20_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD20_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH4 (number 87), J18[C56]/DS1[18]/LCD19
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD19_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD19_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD19_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH3 (number 86), J18[C55]/DS1[19]/LCD18
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD18_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD18_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD18_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH2 (number 85), J18[C54]/DS1[20]/LCD17
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD17_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD17_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD17_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH1 (number 84), J18[C53]/DS1[21]/LCD16
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD16_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD16_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD16_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTH0 (number 83), J18[C52]/DS1[22]/LCD15
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD15_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD15_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD15_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG7 (number 82), J18[C51]/DS1[23]/LCD14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD14_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD14_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD14_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG6 (number 81), J18[C50]/DS1[24]/LCD13
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD13_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD13_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD13_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG5 (number 80), J18[D48]/DS1[25]/LCD12
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD12_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD12_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD12_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG4 (number 79), J18[D47]/DS1[26]/LCD11
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD11_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD11_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD11_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG3 (number 78), J18[D46]/DS1[27]/LCD10
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD10_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD10_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD10_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTG2 (number 77), J18[D45]/DS1[28]/LCD9
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD9_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD9_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD9_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
